Repository: sslavik/acdat
Catalog: TMXParser/en-es.tmx
Source language: en
Languages: es

source: These indicate errors that can not be recovered from, such as a memory allocation problem.
es: Por defecto se visualizan los avisos, pero no se interrumpe la ejecución del guión.

source: The code is listed here only for the sake of completeness.
es: Estos indican un problema que debiera haberse interceptado en el guión antes de la llamada.

source: Functions should not generate this type of error.
es: Por ejemplo, llamar ereg() con una expresión regular no válida.

source: This is like an E_ERROR, except it is generated in PHP code by using the PHP function trigger_error().
es: El código se lista aquí con objeto de ser exhaustivos.

source: This is like an E_WARNING, except it is generated by using the PHP function trigger_error().
es: Este es similar al E_ERROR, pero generado por el núcleo del PHP.

source: This is like an E_NOTICE, except it is generated by using the PHP function trigger_error().
es: Este es similar al E_WARNING, pero generado por el núcleo del PHP.

source: Using this error_reporting level will show all error types.
es: Nota: "N.D.:" significa Nota del Documentador y es un texto interno

source: Calling User Functions
es: Llamando a Funciones del Usuario

source: List of Function Aliases
es: Lista de alias de funciones

source: All functions look like this:
es: Todas las funciones son como esta:

source: void php3_foo( INTERNAL_FUNCTION_PARAMETERS) {}
es: void php3_algo( INTERNAL_FUNCTION_PARAMETERS) {}

source: Arguments are always of type pval.
es: Los argumentos son siempre de tipo pval.

source: This type contains a union which has the actual type of the argument.
es: Este tipo contiene una unión que es el tipo actual del argumento.

source: So, if your function takes two arguments, you would do something like the following at the top of your function:
es: Así, si su función tiene dos argumentos, deberá hacer algo como lo que sigue al principio de la misma:

source: Example E-1.
es: Ejemplo E-1.

source: Fetching function arguments
es: Extrayendo argumentos de función

source: When you change any of the passed parameters, whether they are sent by reference or by value, you can either start over with the parameter by calling pval_destructor on it, or if it 's an ARRAY you want to add to, you can use functions similar to the ones in internal_functions.h which manipulate return_value as an ARRAY.
es: Cuando cambie alguno de los parámetros pasados, tanto si son enviados por referencia o por valor, puede volver a comenzar con éste llamando la función pval_destructor sobre el mismo, o, si es una ARRAY a la que quiere añadir algo, puede utilizar funciones similares a las incluídas en internal_functions.h, que manipulan el valor return_value como si fuera de tipo ARRAY.

source: Also if you change a parameter to IS_STRING make sure you first assign the new estrdup() 'ed string and the string length, and only later change the type to IS_STRING.
es: Además, si cambia un parámetro a IS_STRING, asegúrese primero de asignar el valor y el tamaño a la cadena creada por estrdup() y sólo entonces cambiar su tipo a IS_STRING.

source: If you change the string of a parameter which already IS_STRING or IS_ARRAY you should run pval_destructor on it first.
es: Si modifica la cadena de un parámetro que ya es IS_STRING o IS_ARRAY, deberá primero aplicarle la función pval_destructor.

source: A function can take a variable number of arguments.
es: Una función puede tomar un número variable de argumentos.

source: If your function can take either 2 or 3 arguments, use the following:
es: Si su función puede tomar tanto 2 como 3 argumentos, utilice el siguiente código:

source: Example E-2.
es: Ejemplo E-2.

source: Variable function arguments
es: Argumentos de función variables

source: The type of each argument is stored in the pval type field.
es: El tipo de cada argumento se guarda en el campo type del pval.

source: This type can be any of the following:
es: Este tipo puede ser:

source: Table E-1.
es: Tabla E-1.

source: PHP Internal Types
es: Tipos Internos de PHP

source: String
es: Cadena

source: Double-precision floating point
es: Coma flotante de doble precisión

source: Long integer
es: Entero largo

source: Array
es: Matriz

source: None
es: Nada

source: ?? (if some of these cannot be passed to a function - delete)
es: ?? (N.D.: si alguno de estos no se puede pasar a una función, bórrese)

source: If you get an argument of one type and would like to use it as another, or if you just want to force the argument to be of a certain type, you can use one of the following conversion functions:
es: Si obtiene un argumento de un tipo y desea utilizarlo como si fuera de otro, o si quiere forzar a que un argumento sea de un tipo determinado, puede usar una de las siguientes funciones de conversión:

source: convert_to_long( arg1); convert_to_double(arg1); convert_to_string(arg1); convert_to_boolean_long(arg1); / * If the string is "" or "0 "it becomes 0, 1 otherwise * / convert_string_to_number(arg1); / * Converts string to either LONG or DOUBLE depending on string * /
es: convert_to_long( arg1); convert_to_double(arg1); convert_to_string(arg1); convert_to_boolean_long(arg1); / * Si la cadena es "" o "0 "pasa a ser 0; si no, vale 1 * / convert_string_to_number(arg1); / * Convierte la cadena a LONG o a DOUBLE, dependiendo de su contenido * /

source: These function all do in-place conversion.
es: Estas funciones convierten el valor in-situ.

source: They do not return anything.
es: No devuelven nada.

source: The actual argument is stored in a union; the members are:
es: El argumento real es almacenado en una unión cuyos miembros son:

source: Any memory needed by a function should be allocated with either emalloc() or estrdup().
es: La memoria necesitada por una función deberá ser asignada usando emalloc() o estrdup().

source: These are memory handling abstraction functions that look and smell like the normal malloc() and strdup() functions.
es: Estas son funciones abstractas de manejo de memoria que son similares a las funciones normales malloc() y strdup().

source: Memory should be freed with efree().
es: La memoria deberá liberarse con efree().

source: There are two kinds of memory in this program: memory which is returned to the parser in a variable, and memory which you need for temporary storage in your internal function.
es: Hay dos tipos de memoria en este programa: la memoria que se devuelve al troceador (parser) en una variable, y la memoria que se necesita para almacenamiento temporal de datos en sus funciones.

source: When you assign a string to a variable which is returned to the parser you need to make sure you first allocate the memory with either emalloc() or estrdup().
es: Cuando asigne una cadena a una variable que se devolverá al troceador deberá asegurarse previamente de asignar la memoria con emalloc() o con estrdup().

source: This memory should NEVER be freed by you, unless you later in the same function overwrite your original assignment (this kind of programming practice is not good though).
es: Esta memoria NUNCA debe ser liberada por usted, salvo si más adelante, en la misma función, sobreescribe la asignación original (aunque este hábito de programación no es bueno).

source: For any temporary / permanent memory you need in your functions / library you should use the three emalloc(), estrdup(), and efree() functions.
es: Para cada trozo de memoria temporal / permanente que precise en sus funciones / librería deberá utilizar las funciones emalloc(), estrdup(), y efree().

source: They behave EXACTLY like their counterpart functions.
es: Estas se comportan EXACTAMENTE como sus funciones equivalentes.

source: Anything you emalloc() or estrdup() you have to efree() at some point or another, unless it's supposed to stick around until the end of the program; otherwise, there will be a memory leak.
es: Cualquier cosa que asigne con emalloc() o estrdup() deberá liberarla con efree() en uno u otro momento, salvo que se suponga que deba permanecer activa hasta el final del programa; de otro modo, se producirá una fuga de memoria.

source: The meaning of "the functions behave exactly like their counterparts" is: if you efree() something which was not emalloc()'ed nor estrdup() 'ed you might get a segmentation fault.
es: El significado de "estas se comportan exactamente como sus funciones equivalentes" es: si llama a efree() sobre algo que no ha sido asignado previamente con emalloc() o con estrdup(), puede provocar un fallo de segmentación.

source: So please take care and free all of your wasted memory.
es: Por ello debe tener cuidado y liberar toda la memoria desperdiciada.

source: If you compile with "-DDEBUG", PHP will print out a list of all memory that was allocated using emalloc() and estrdup() but never freed with efree() when it is done running the specified script.
es: Si compila con "-DDEBUG", el PHP3 mostrará una lista de toda la memoria que fue asignada usando emalloc() y estrdup(), pero que nunca fue liberada con efree(), al terminar de ejecutar el guión especificado.

source: A number of macros are available which make it easier to set a variable in the symbol table:
es: Están disponibles una serie de macros que hacen más fácil el asignar una variale en la tabla de símbolos:

source: SET_VAR_STRING( name,value)
es: SET_VAR_STRING( nombre,valor) [1]

source: SET_VAR_DOUBLE( name,value)
es: SET_VAR_DOUBLE( nombre,valor)

source: Do not pass statically allocated memory into a SET_VAR_STRING.
es: Las tablas de símbolos en PHP 3.0 se implementan como tablas hash (con extracto).

source: At any given time, symbol_table is a pointer to the 'main' symbol table, and active_symbol_table points to the currently active symbol table (these may be identical like in startup, or different, if you're inside a function).
es: En todo momento, symbol_table es un puntero a la tabla de símbolos 'principal', mientras que active_symbol_table apunta a la tabla de símbolos activa (pueden ser idénticas, al principio de todo, o diferentes, si se está dentro de una función).

source: The following examples use 'active_symbol_table'.
es: Los ejemplos siguientes utilizan 'active_symbol_table'.

source: You should replace it with symbol_table if you specifically want to work with the 'main' symbol table.
es: Deberá reemplazarla por symbol_table si desea trabajar específicamente con la tabla de símbolos 'principal'.

source: Also, the same functions may be applied to arrays, as explained below.
es: También se pueden aplicar las mismas funciones a matrices, como se explica más abajo.

source: Example E-3.
es: Ejemplo E-3.

source: Checking whether $foo exists in a symbol table
es: Comprobando si $algo existe en una tabla de símbolos

source: if (hash_exists(active_symbol_table ,"foo",sizeof("foo"))) {exists...} else {doesn't exist}
es: if (hash_exists(active_symbol_table ,"algo",sizeof("algo"))) {existe...} else {no existe}

source: Example E-4.
es: Ejemplo E-4.

source: Finding a variable 's size in a symbol table
es: Hallando el tamaño de una variable en una tabla de símbolos

source: hash_find( active_symbol_table ,"foo",sizeof("foo"), pvalue); check(pvalue.type);
es: hash_find( active_symbol_table ,"algo",sizeof("algo"), valptr); check(valptr.type);

source: If you want to define a new array in a symbol table, you should do the following.
es: Si desea definir un nuevo símbolo de matriz en una tabla de símbolos, deberá hacer lo que sigue.

source: First, you may want to check whether it exists and abort appropriately, using hash_exists() or hash_find().
es: Primero, deberá comprobar si ya existe usando hash_exists() o hash_find() y abortar la ejecución de forma apropiada.

source: Next, initialize the array:
es: Luego inicialice la matriz:

source: Example E-5.
es: Ejemplo E-5.

source: Initializing a new array
es: Inicializando una nueva matriz

source: pval arr; if (array_init (arr) == FAILURE) {failed...}; hash_update(active_symbol_table ,"foo",sizeof("foo"), arr,sizeof(pval),NULL);
es: pval matriz; if (array_init (matriz) == FAILURE) {falló...}; hash_update(active_symbol_table ,"algo",sizeof("algo"), matriz,sizeof(pval),NULL);

source: Here 's how to add new entries to it:
es: Ahora se muestra cómo añadirle elementos:

source: Example E-6.
es: Ejemplo E-6.

source: Adding entries to a new array
es: Añadir entradas a una nueva matriz

source: pval entry; entry.type = IS_LONG; entry.value.lval = 5; / * defines $foo["bar"] = 5 * / hash_update(arr.value.ht ,"bar",sizeof("bar"), entry,sizeof(pval),NULL); / * defines $foo[7] = 5 * / hash_index_update(arr.value.ht,7, entry,sizeof(pval),NULL); / * defines the next free place in $foo[], * $foo[8], to be 5 (works like php2) * / hash_next_index_insert(arr.value.ht, entry,sizeof(pval),NULL);
es: pval elemento; elemento.type = IS_LONG; elemento.value.lval = 5; / * define $algo["bar"] = 5 * / hash_update(matriz.value.ht ,"bar",sizeof("bar"), elemento,sizeof(pval),NULL); / * define $algo[7] = 5 * / hash_index_update(matriz.value.ht,7, elemento,sizeof(pval),NULL); / * define el siguiente puesto libre en $algo[], * $algo[8], como 5 (funciona como en php2) * / hash_next_index_insert(matriz.value.ht, elemento,sizeof(pval),NULL);

source: hash_next_index_insert() uses more or less the same logic as "$foo[] = bar; "in PHP 2.0.
es: hash_next_index_insert() usa más o menos la misma lógica que "$algo[] = bar; "en el PHP 2.0.

source: If you are building an array to return from a function, you can initialize the array just like above by doing:
es: Si está preparando una matriz como valor devuelto por una función, puede inicializar la misma como antes, haciendo:

source: if (array_init(return_value) == FAILURE) {failed...;}
es: if (array_init(return_value) == FAILURE) {falló...;}

source: ...and then adding values with the helper functions:
es: ... y luego añadiéndole valores con las funciones auxiliares:

source: add_next_index_long( return_value,long_value); add_next_index_double(return_value,double_value); add_next_index_string(return_value,estrdup(string_value));
es: add_next_index_long( return_value,val_long); add_next_index_double(return_value,val_double); add_next_index_string(return_value,estrdup(val_cadena));

source: Of course, if the adding isn' t done right after the array initialization, you'd probably have to look for the array first:
es: Por supuesto, si la adición no se realiza justo después de inicializar la matriz, probablemente tenga que buscarla antes:

source: pval *arr; if (hash_find(active_symbol_table ,"foo",sizeof("foo") ,(void **) arr)==FAILURE) {can't find...} else {use arr - value.ht...}
es: pval *matriz; if (hash_find(active_symbol_table ,"algo",sizeof("algo") ,(void **) matriz)==FAILURE) {no se hayó...} else {usar matriz - value.ht...}

source: Note that hash_find receives a pointer to a pval pointer, and not a pval pointer.
es: Nótese que hash_find recibe un puntero a un puntero a pval, y no un puntero a pval.

source: Just about any hash function returns SUCCESS or FAILURE (except for hash_exists(), which returns a boolean truth value).
es: Casi cualquier función de matrices asociativas devuelve SUCCESS o FAILURE (excepto por hash_exists(), que devuelve un valor lógico de certeza).

source: A number of macros are available to make returning values from a function easier.
es: Están disponibles varias macros para facilitar la devolución de valores de una función.

source: The RETURN_* macros all set the return value and return from the function:
es: Todas las macros RETURN_* fijan el valor y retornan de la función:

source: RETURN_STRING( s,dup) If dup is TRUE, duplicates the string
es: RETURN_STRING( s,dup) Si dup es TRUE, duplica la cadena

source: RETURN_STRINGL( s,l,dup) Return string (s) specifying length (l).
es: RETURN_STRINGL( s,l,dup) Devuelve la cadena (s) especificando el largo (l).

source: The RETVAL_* macros set the return value, but do not return.
es: Las macros RETVAL_* fijan el valor, pero no retornan.

source: RETVAL_STRING( s,dup) If dup is TRUE, duplicates the string
es: RETVAL_STRING( s,dup) Si dup es TRUE, duplica la cadena

source: RETVAL_STRINGL( s,l,dup) Return string (s) specifying length (l).
es: RETVAL_STRINGL( s,l,dup) Devuelve la cadena (s) especificando el largo (l).

source: The string macros above will all estrdup() the passed's' argument, so you can safely free the argument after calling the macro, or alternatively use statically allocated memory.
es: Las macros anteriores harán un estrdup() del argumento 's ', de modo que puede liberar con seguridad el argumento después de llamar a la macro, o, alternativamente, utilizar memoria asignada estáticamente.

source: If your function returns boolean success / error responses, always use RETURN_TRUE and RETURN_FALSE respectively.
es: Si su función devuelve respuestas lógicas de éxito / error, use siempre RETURN_TRUE y RETURN_FALSE respectivamente.

source: Your function can also return a complex data type such as an object or an array.
es: Su función también puede devolver un tipo de datos complejo, tal como un objeto o una matriz.

source: Returning an object:
es: Devolviendo un objeto:

source: Call object_init( return_value).
es: Llame a object_init( return_value).

source: Fill it up with values.
es: Rellénela con valores.

source: The functions available for this purpose are listed below.
es: Las funciones disponibles para ello son listadas más abajo.

source: Possibly, register functions for this object.
es: Posilemente registre funciones para este objeto.

source: In order to obtain values from the object, the function would have to fetch "this" from the active_symbol_table.
es: Para obtener valores del objeto, la función deberá de obtener "this" desde la active_symbol_table.

source: Its type should be IS_OBJECT, and it' s basically a regular hash table (i.e., you can use regular hash functions on .value.ht).
es: Su tipo deberá ser IS_OBJECT, y básicamente se trata de una matriz asociativa estándar (es decir, que podrá usar funciones de matriz asociativa sobre .value.ht).

source: The actual registration of the function can be done using:
es: El registro en sí de la función se puede hacer utilizando:

source: add_method( return_value, function_name, function_ptr);
es: add_method( return_value, nombre_func, puntero_func);

source: The functions used to populate an object are:
es: Las funciones utilizadas para rellenar un objeto son:

source: add_property_long( return_value, property_name, l) - Add a property named'property_name', of type long, equal to'l '
es: add_property_long( return_value, nombre_propiedad, l) - Añade una propiedad llamada 'nombre_propiedad', de tipo long, y con valor 'l '

source: add_property_double( return_value, property_name, d) - Same, only adds a double
es: add_property_double( return_value, nombre_propiedad, d) - Igual, pero añadiendo un double

source: add_property_string( return_value, property_name, str) - Same, only adds a string
es: add_property_string( return_value, nombre_propiedad, cad) - Igual, pero añadiendo una cadena

source: add_property_stringl( return_value, property_name, str, l) - Same, only adds a string of length'l '
es: add_property_stringl( return_value, nombre_propiedad, cad, l) - Igual, pero añadiendo una cadena de longitud 'l '

source: Returning an array:
es: Devolviendo una matriz:

source: Call array_init( return_value).
es: Llame a array_init( return_value).

source: The functions used to populate an array are:
es: Las funciones utilizadas para rellanar una matriz son:

source: add_assoc_long( return_value,key,l) - add associative entry with key'key 'and long value'l'
es: add_assoc_long( return_value,clave,l) - añade un elemento asociativo con clave 'clave 'y valor long 'l'

source: add_assoc_double( return_value,key,d)
es: add_assoc_double( return_value,clave,d)

source: add_assoc_string( return_value,key,str,duplicate)
es: add_assoc_string( return_value,clave,cad,duplicar)

source: add_assoc_stringl( return_value,key,str,length,duplicate) specify the string length
es: add_assoc_stringl( return_value,clave,cad,largo,duplicar) - especifica el largo de la cadena

source: add_index_long( return_value,index,l) - add entry in index'index 'with long value'l'
es: add_index_long( return_value,indice,l) - añade un elemento en la posición 'indice 'con valor long 'l'

source: add_index_double( return_value,index,d)
es: add_index_double( return_value,indice,d)

source: add_index_string( return_value,index,str)
es: add_index_string( return_value,indice,cad)

source: add_index_stringl( return_value,index,str,length) - specify the string length
es: add_index_stringl( return_value,indice,cad,largo) - especifica el largo de la cadena

source: add_next_index_long( return_value,l) - add an array entry in the next free offset with long value'l '
es: add_next_index_long( return_value,l) - añade un elemento a la matriz en la próxima posición libre con valor long 'l '

source: add_next_index_string( return_value,str)
es: add_next_index_string( return_value,cad)

source: add_next_index_stringl( return_value,str,length) - specify the string length
es: add_next_index_stringl( return_value,cad,largo) - especifica el largo de la cadena

source: PHP has a standard way of dealing with various types of resources.
es: El PHP 3.0 tiene una forma estandarizada de tratar con distintos tipos de recursos.

source: This replaces all of the local linked lists in PHP 2.0.
es: Esto sustituye a las listas enlazadas locales del PHP 2.0.

source: Available functions:
es: Funciones disponibles:

source: php3_list_insert( ptr, type) - returns the'id 'of the newly inserted resource
es: php3_list_insert( ptr, tipo) - devuelve el 'id 'del recurso recién insertado

source: php3_list_delete( id) - delete the resource with the specified id
es: php3_list_delete( id) - borra el recurso con el id especificado

source: php3_list_find( id,*type) - returns the pointer of the resource with the specified id, updates'type 'to the resource's type
es: php3_list_find( id,*tipo) - devuelve el puntero al recurso con el id especificado, y actualiza 'tipo 'al tipo del mismo

source: Typical list code would look like this:
es: El código típico de un lista sería como este:

source: Example E-7.
es: Ejemplo E-7.

source: Adding a new resource
es: Añadiendo un nuevo recurso

source: RESOURCE *resource; / * ...allocate memory for resource and acquire resource... * / / * add a new resource to the list * / return_value - value.lval = php3_list_insert((void *) resource, LE_RESOURCE_TYPE); return_value - type = IS_LONG;
es: RESOURCE *recurso; / * ...asignar memoria para el recurso y adquirirlo... * / / * añadir un recurso a la lista * / return_value - value.lval = php3_list_insert((void *) recurso, LE_RESOURCE_TYPE); return_value - type = IS_LONG;

source: Example E-8.
es: Ejemplo E-8.

source: Using an existing resource
es: Utilizando un recurso existente

source: pval *resource_id; RESOURCE *resource; int type; convert_to_long(resource_id); resource = php3_list_find(resource_id - value.lval, type); if (type != LE_RESOURCE_TYPE) {php3_error(E_WARNING ,"resource index %d has the wrong type",resource_id - value.lval); RETURN_FALSE;} / * ...use resource... * /
es: pval *id_recurso; RESOURCE *recurso; int tipo; convert_to_long(id_recurso); recurso = php3_list_find(id_recurso - value.lval, tipo); if (tipo != LE_RESOURCE_TYPE) {php3_error(E_WARNING ,"el recurso número %d tiene el tipo equivocado",id_recurso - value.lval); RETURN_FALSE;} / * ...usar recurso... * /

source: Example E-9.
es: Ejemplo E-9.

source: Deleting an existing resource
es: Borrando un recurso
